#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```terraform

azurerm_resource_group.resourcegroup: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg]
azurerm_user_assigned_identity.app_gateway: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway]
azurerm_user_assigned_identity.aks: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-aks]
module.virtual_network.azurerm_virtual_network.base_network: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network]
module.virtual_network.azurerm_subnet.frontend: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/frontend-subnet]
module.application_gateway.azurerm_public_ip.ag_public_ip: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/publicIPAddresses/poc-ag-public_ip]
module.application_gateway.azurerm_application_gateway.app_gateway: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag]
module.aks_cluster.azurerm_subnet.kubernetes_node_pool_default: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default]
module.aks_cluster.data.azurerm_client_config.current: Reading...
module.aks_cluster.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD0yZTk3YTcwMi1mM2NkLTRjZjAtOTNmMC00ZmI3M2RiNGI4NzQ7b2JqZWN0SWQ9ZjM0YjliYTYtYTJiNi00OWJiLWFhZjEtZWVjNzlkMDExZGI5O3N1YnNjcmlwdGlvbklkPTliMWVkYWQwLTlhMTMtNGM3YS05MjJhLThkNzljYjE5ZmY4Mzt0ZW5hbnRJZD00YTczYjFiOS03MWExLTRmMGUtODRhMi00ZmRkODI4Y2E3YmM=]
module.aks_cluster.data.azurerm_user_assigned_identity.application_gateway: Reading...
module.aks_cluster.azurerm_role_assignment.subnet_kubernetes_node_pool_default_role_assignment: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/virtualNetworks/poc-network/subnets/dev-kubernetes-nodepool-default/providers/Microsoft.Authorization/roleAssignments/3822963c-d692-c9b3-44ac-b4af265a67f7]
module.aks_cluster.azurerm_kubernetes_cluster.aks_cluster: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ContainerService/managedClusters/aks]
module.aks_cluster.data.azurerm_user_assigned_identity.application_gateway: Read complete after 1s [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway]
module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_reader: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Authorization/roleAssignments/6a0e1421-4175-fa63-7581-7e9ebd506b01]
module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_contributor: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag/providers/Microsoft.Authorization/roleAssignments/3d951ccf-2951-0674-ff6c-1b5974828739]
module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignement_operator: Refreshing state... [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.ManagedIdentity/userAssignedIdentities/poc-identity-app-gateway/providers/Microsoft.Authorization/roleAssignments/391a6ac8-f729-b2dd-4cdf-5aa084df3c96]
module.aks_cluster.data.azurerm_user_assigned_identity.aks_ingress_application_gateway: Reading...
module.aks_cluster.data.azurerm_user_assigned_identity.aks_ingress_application_gateway: Read complete after 0s [id=/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/MC_poc-rg_aks_eastus/providers/Microsoft.ManagedIdentity/userAssignedIdentities/ingressapplicationgateway-aks]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_contributor will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignment_contributor" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f499ba9e-b878-4089-a4c8-924e1b8d5070"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Contributor"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg/providers/Microsoft.Network/applicationGateways/poc-ag"
      + skip_service_principal_aad_check = (known after apply)
    }

  # module.aks_cluster.azurerm_role_assignment.aks_app_gateway_rg_role_assignment_reader will be created
  + resource "azurerm_role_assignment" "aks_app_gateway_rg_role_assignment_reader" {
      + id                               = (known after apply)
      + name                             = (known after apply)
      + principal_id                     = "f499ba9e-b878-4089-a4c8-924e1b8d5070"
      + principal_type                   = (known after apply)
      + role_definition_id               = (known after apply)
      + role_definition_name             = "Reader"
      + scope                            = "/subscriptions/9b1edad0-9a13-4c7a-922a-8d79cb19ff83/resourceGroups/poc-rg"
      + skip_service_principal_aad_check = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @dtags, Action: `pull_request`*